Олег, здравствуйте.

Хотела уточнить - пересмотрите ли вы оценку, пожалуйста, - если я внесу исправления по вашим замечаниям?
Мой гитхаб - https://github.com/adelinyshka
Моя работа - https://adelinyshka.github.io/singolo/index.html
http://joxi.ru/a2XODb0iwB1pEm - скриншот


Олег, я бы хотела уточнить такой момент - что мы проверяем работу по кросс-чеку. А не по изначально выданному таску.
Поэтому  я к вам пишу и прошу или перепроверить работу или дать шанс исправить под ваши требования, пожалуйста.

Вот ссылка на кросс-чек с которым мы сверяем:
https://github.com/rolling-scopes-school/tasks/blob/master/tasks/markups/level-2/singolo/singolo-cross-check-2-ru.md

Могу ли я попросить вас не придумывать своих правил, пожалуйста. Тк надо готовиться к собеседованию с ментором и делать вируальную клавиатуру.
Но если это важно - то могу переделать, если вы поднимите оценку. Мне очень важен скор.

1. Указанных требований нет в кросс-чеке
1.1 В поле после ввода "xxx@xxxxx" в поле email оно начинает просить ввести данные в указанном формате, но не пишет сам этот формат

(необходимо самому догадаться, что надо вводить xxx@xxx.xx) -1

1,2 Поле describe при малой ширине экрана вылазит за пределы экрана -3

1,3 Отступы стрелок не соответствуют макету на промежуточных ширинах -3
1,4 Изображения в портфолио совершенно не соблюдают на промежуточных ширинах -3
1,5 ---- макет в фигма 375 по задаче начинает действовать от 767px -3
1,6 ширина 375px: * у заголовка съехала вниз, между пунктами остались видны точки -3

Прошу вас обратить внимание, что проверку надо производить по кросс-чеку, в самом низу которого указано:
И напутствие напоследок: если вы до конца не уверены, снижать балл, или не снижать, то не снижайте. Относитесь с уважением друг к другу.

С уважением, Адель
89217446611 (WhatsApp)
@adel_dubinnikova (telegram)
@adelinyshka(Disqord)
